alex-roos-website.org
#+TITLE: Alex Roos Work Website
#+STARTUP: content
# #+HUGO_BASE_DIR: /sshx:tipxmr:/home/tipxmr/alex-roos/
#+HUGO_BASE_DIR: /home/alex/Coding/alex-roos/
# #+HUGO_AUTO_SET_LASTMOD: t
#+AUTHOR: Alex Roos

** DONE Cryptocurrencies and Cryptography
:PROPERTIES:
:EXPORT_FILE_NAME: crypto
:EXPORT_HUGO_SECTION: thoughts
:EXPORT_HUGO_TAGS: opensource crypto
:EXPORT_HUGO_PUBLISHDATE: 2021-03-03
:END:
*** Falling down the Bitcoin rabbit hole
The end of my studies in /"Management, Philosophy & Economics"/ coincided with a peaked interest in Bitcoin near the end of 2016. So, for the topic of my thesis I chose to write about "Blockchain Technology". After finishing my studies, I started at BTC-ECHO to write about developments in the space.

Researching the articles I had to write, I learned much about cryptography, PGP, and adverserial thinking. Gradually my interested shifted from the economic implications to the actual technology itself.

To understand Bitcoin, I needed to know what a hash is, how a blockchain uses these hashes for a Proof-of-Work and so on. This is what basically got me interested in computer sciences again.
*** Cryptography is all around us
The aquired knowledge proofs useful to this day. I was amazed to learn that asymmetric cryptography is all around us, from the websites to the messengers. Everything that needs security, benefits from public key cryptography.

While I certainly don't understand the cryptography itself, I can still utilise it. Just imagine my amazement, when I figured out how to use the ~.ssh/~ to automatically - and more securely - establish a contection to remote machines.

*** Cryptocurrencies are the future
My fascination with cryptocurrencies has not waned. I find it especially thrilling to create programs that interact with cryptocurrencies in some way, like [[MoneroBlocksBot]] or [[TipXMR]].
