content/thoughts/crypto.md
+++
title = "Cryptocurrencies and Cryptography"
author = ["Alex Roos"]
publishDate = 2021-03-03
tags = ["opensource", "crypto"]
draft = false
+++

## Falling down the Bitcoin rabbit hole {#falling-down-the-bitcoin-rabbit-hole}

The end of my studies in _"Management, Philosophy & Economics"_ coincided with a peaked interest in Bitcoin near the end of 2016. So, for the topic of my thesis I chose to write about "Blockchain Technology". After finishing my studies, I started at BTC-ECHO to write about developments in the space.

Researching the articles I had to write, I learned much about cryptography, PGP, and adverserial thinking. Gradually my interested shifted from the economic implications to the actual technology itself.

To understand Bitcoin, I needed to know what a hash is, how a blockchain uses these hashes for a Proof-of-Work and so on. This is what basically got me interested in computer sciences again.

## Cryptography is all around us {#cryptography-is-all-around-us}

The aquired knowledge proofs useful to this day. I was amazed to learn that asymmetric cryptography is all around us, from the websites to the messengers. Everything that needs security, benefits from public key cryptography.

While I certainly don't understand the cryptography itself, I can still utilise it. Just imagine my amazement, when I figured out how to use the `.ssh/` to automatically - and more securely - establish a contection to remote machines.

## Cryptocurrencies are the future {#cryptocurrencies-are-the-future}

My fascination with cryptocurrencies has not waned. I find it especially thrilling to create programs that interact with cryptocurrencies in some way, like [MoneroBlocksBot]({{< relref "MoneroBlocksBot" >}}) or [TipXMR]({{< relref "TipXMR" >}}).
